## Dataframes

In [1]:
"""  Importacion de la libreria numpy  """
import numpy

"""  Creacion de un arreglo  """
arreglo = numpy.array([[1,2,3],[4,5,6],[7,8,9]])
arreglo

array([[1, 2, 3],
       [4, 5, 6],
       [7, 8, 9]])

In [6]:
# Asignacion de alias a la libresia
import numpy as np

"""  Creacion de un arreglo  """
arreglo = np.array([[1,2,3],[4,5,6],[7,8,9]])
arreglo

array([[1, 2, 3],
       [4, 5, 6],
       [7, 8, 9]])

In [7]:
"""  Trasformamos el array en forma tabular (dataframe)  """
import pandas as pd

"""  Creacion del dataframe  """
df = pd.DataFrame(arreglo)
df

   0  1  2
0  1  2  3
1  4  5  6
2  7  8  9

In [8]:
"""  Modificaciond e las columnas del dataframe  """
df = pd.DataFrame(data = arreglo, index = ['A','B','C'], columns = ['D','E','F'])
df

   D  E  F
A  1  2  3
B  4  5  6
C  7  8  9

In [9]:
"""  Asignacion de cuantos registros queremos extraer  """
# Seccion superior (Encabezado)
df.head(2)

   D  E  F
A  1  2  3
B  4  5  6

In [10]:
# Informacion de cada columna
df.info()

<class 'pandas.core.frame.DataFrame'>
Index: 3 entries, A to C
Data columns (total 3 columns):
 #   Column  Non-Null Count  Dtype
---  ------  --------------  -----
 0   D       3 non-null      int64
 1   E       3 non-null      int64
 2   F       3 non-null      int64
dtypes: int64(3)
memory usage: 96.0+ bytes

In [11]:
# Dimension del dataframe
# (Cantidad de datos)
df.shape

(3, 3)

In [12]:
"""  Calculo de estadisticas generales de la tablas  """
df.describe()

         D    E    F
count  3.0  3.0  3.0
mean   4.0  5.0  6.0
std    3.0  3.0  3.0
min    1.0  2.0  3.0
25%    2.5  3.5  4.5
50%    4.0  5.0  6.0
75%    5.5  6.5  7.5
max    7.0  8.0  9.0

In [13]:
"""  Extrater los nombres de las columnas  """
df.columns

Index(['D', 'E', 'F'], dtype='object')

In [14]:
"""  Extrater los nombres de los renglones  """
df.index

Index(['A', 'B', 'C'], dtype='object')

In [15]:
"""  Adiccion de un nuevo reglon al dataframe  """
df.loc['G'] = [11,12,13]
df

    D   E   F
A   1   2   3
B   4   5   6
C   7   8   9
G  11  12  13

In [16]:
"""  Adiccion de una nueva columna al dataframe  """
df['H'] = [17,16,15,14]
df

    D   E   F   H
A   1   2   3  17
B   4   5   6  16
C   7   8   9  15
G  11  12  13  14

In [17]:
"""  Extraccion de columnas del dataframe  """
df2 = df[['E', 'H']]
df2

    E   H
A   2  17
B   5  16
C   8  15
G  12  14

In [18]:
"""  Extraccion de renglones del dataframe  """
df3 = df.iloc[0:2] # Extrae los primeros dos renglones
df3

   D  E  F   H
A  1  2  3  17
B  4  5  6  16

In [19]:
"""  Cambio de nombre de TODAS las columnas  """
df.columns = ['Columna1', 'Columna2','Columna3','Columna4']
df

   Columna1  Columna2  Columna3  Columna4
A         1         2         3        17
B         4         5         6        16
C         7         8         9        15
G        11        12        13        14

In [20]:
"""  Cambio de nombre de ALGUNAS las columnas  """
df.rename(columns = {'Columna1':'Column1','Columna3':'column3'}, inplace = True)
df

   Column1  Columna2  column3  Columna4
A        1         2        3        17
B        4         5        6        16
C        7         8        9        15
G       11        12       13        14

In [21]:
"""  Cambio de nombre en los renglones  """
df.rename(index = { "A":"Dato1", "B":"Dato2"}, inplace = True)
df

       Column1  Columna2  column3  Columna4
Dato1        1         2        3        17
Dato2        4         5        6        16
C            7         8        9        15
G           11        12       13        14

In [22]:
"""  Ordenamiento de dataframes  """
df4 = df.sort_values("Columna4", ascending = True)
df4

       Column1  Columna2  column3  Columna4
G           11        12       13        14
C            7         8        9        15
Dato2        4         5        6        16
Dato1        1         2        3        17

In [23]:
"""  Verificacion de condiciones en dataframe  """
df["Columna2"] > 5

Dato1    False
Dato2    False
C         True
G         True
Name: Columna2, dtype: bool

In [24]:
df[df["Columna2"] > 5]

   Column1  Columna2  column3  Columna4
C        7         8        9        15
G       11        12       13        14

In [26]:
condicion1 = df["Column1"] > 1
condicion2 = df["Columna2"] < 12
df[condicion1 & condicion2]

       Column1  Columna2  column3  Columna4
Dato2        4         5        6        16
C            7         8        9        15

## Ejercicio

### Mediante el uso de las librerías NumPy y Pandas desarrolle un código en Python que sea capaz de generar el siguiente Dataframe:
1) Extraiga aquellos registros de los perros cuya fecha de nacimiento es anterior al 1 de Enero del 2015
2) Extraiga aquellos registros de los perros cuya estatura es mayor a 50 cms.
3) Agregue una nueva columna a este Dataframe que calcule el índice de masa muscular (IMM) para cada perro, el cual está dado por la fórmula:

In [36]:
arreglo = np.array([['Bella', 'Labrador', 'Cafe', 56, 24, '2013-07-01'],
                   ['Max', 'Schnauzer', 'Cafe', 40, 24, '2014-07-01'],
                   ['Fido', 'San Bernardo', 'Cafe', 77, 24, '2017-07-01'],
                   ['Richi', 'Poodle', 'Negro', 43, 17, '2016-07-01'],
                   ['Luck', 'Schnauzer', 'Cafe', 20, 20, '2016-07-01'],
                   ['Bernie', 'Chow chow', 'Blanco', 46, 24, '2013-07-01'],
                   ['Lucy', 'Chihuahua', 'Gris', 15, 15, '2015-07-01']])
arreglo

array([['Bella', 'Labrador', 'Cafe', '56', '24', '2013-07-01'],
       ['Max', 'Schnauzer', 'Cafe', '40', '24', '2014-07-01'],
       ['Fido', 'San Bernardo', 'Cafe', '77', '24', '2017-07-01'],
       ['Richi', 'Poodle', 'Negro', '43', '17', '2016-07-01'],
       ['Luck', 'Schnauzer', 'Cafe', '20', '20', '2016-07-01'],
       ['Bernie', 'Chow chow', 'Blanco', '46', '24', '2013-07-01'],
       ['Lucy', 'Chihuahua', 'Gris', '15', '15', '2015-07-01']],
      dtype='<U21')

In [37]:
df = pd.DataFrame(data=arreglo, columns=['Nombre', 'Raza', 'Color', 'Altura_cm', 'Peso_kg', 'Fecha_nac'])
df

   Nombre          Raza   Color Altura_cm Peso_kg   Fecha_nac
0   Bella      Labrador    Cafe        56      24  2013-07-01
1     Max     Schnauzer    Cafe        40      24  2014-07-01
2    Fido  San Bernardo    Cafe        77      24  2017-07-01
3   Richi        Poodle   Negro        43      17  2016-07-01
4    Luck     Schnauzer    Cafe        20      20  2016-07-01
5  Bernie     Chow chow  Blanco        46      24  2013-07-01
6    Lucy     Chihuahua    Gris        15      15  2015-07-01

In [38]:
df2 = df[df['Fecha_nac'] < '2015-01-01']
df2

   Nombre       Raza   Color Altura_cm Peso_kg   Fecha_nac
0   Bella   Labrador    Cafe        56      24  2013-07-01
1     Max  Schnauzer    Cafe        40      24  2014-07-01
5  Bernie  Chow chow  Blanco        46      24  2013-07-01

In [39]:
df['Altura_cm'] = df['Altura_cm'].astype(int) # Cambiamos el tipo de dato a entero

In [40]:
df[df['Altura_cm'] > 50]

  Nombre          Raza Color  Altura_cm Peso_kg   Fecha_nac
0  Bella      Labrador  Cafe         56      24  2013-07-01
2   Fido  San Bernardo  Cafe         77      24  2017-07-01

In [41]:
df['Peso_kg'] = df['Peso_kg'].astype(int) # Cambios el tipo de dato a entero

In [43]:
df['IMM'] = df['Peso_kg'] / (df['Altura_cm'] / 100) ** 2
df

   Nombre          Raza   Color  Altura_cm  Peso_kg   Fecha_nac         IMM
0   Bella      Labrador    Cafe         56       24  2013-07-01   76.530612
1     Max     Schnauzer    Cafe         40       24  2014-07-01  150.000000
2    Fido  San Bernardo    Cafe         77       24  2017-07-01   40.479002
3   Richi        Poodle   Negro         43       17  2016-07-01   91.941590
4    Luck     Schnauzer    Cafe         20       20  2016-07-01  500.000000
5  Bernie     Chow chow  Blanco         46       24  2013-07-01  113.421550
6    Lucy     Chihuahua    Gris         15       15  2015-07-01  666.666667

In [44]:
"""  Extraccion de calumnas especificas  """
df2 = df[['Nombre','Raza','IMM']]
df2

   Nombre          Raza         IMM
0   Bella      Labrador   76.530612
1     Max     Schnauzer  150.000000
2    Fido  San Bernardo   40.479002
3   Richi        Poodle   91.941590
4    Luck     Schnauzer  500.000000
5  Bernie     Chow chow  113.421550
6    Lucy     Chihuahua  666.666667

In [45]:
df2 = df2.sort_values("IMM", ascending = True)
df2

   Nombre          Raza         IMM
2    Fido  San Bernardo   40.479002
0   Bella      Labrador   76.530612
3   Richi        Poodle   91.941590
5  Bernie     Chow chow  113.421550
1     Max     Schnauzer  150.000000
4    Luck     Schnauzer  500.000000
6    Lucy     Chihuahua  666.666667